import 'package:test/test.dart';

import 'package:bottom_rs_dart/bottom_rs_dart.dart';

void main() {
  test('Checks if functions work', () {
    final bottom = Bottom();
    expect(bottom.encode_string("Test"), "💖✨✨✨,,,,👉👈💖💖,👉👈💖💖✨🥺👉👈💖💖✨🥺,👉👈"); //TODO tests
    expect(bottom.decode_string("💖✨✨✨,,,,👉👈💖💖,👉👈💖💖✨🥺👉👈💖💖✨🥺,👉👈"), "Test");
    expect(bottom.encode_string("がんばれ"),
        """✨✨🥺,,👉👈💖💖✨✨🥺,,,,👉👈💖💖✨✨✨✨👉👈🫂✨✨🥺,,👉👈💖💖✨✨✨👉👈💖💖✨✨✨✨🥺,,👉👈🫂✨✨🥺,,👉👈💖💖✨✨🥺,,,,👉👈💖💖💖✨✨🥺,👉👈🫂✨✨🥺,,👉👈💖💖✨✨✨👉👈💖💖✨✨✨✨👉👈""");
  });
}
